package com.example.skrineybackend.enums;

public enum Currency {
  USD, // Доллар США
  EUR, // Евро
  JPY, // Японская иена
  GBP, // Британский фунт стерлингов
  AUD, // Австралийский доллар
  CAD, // Канадский доллар
  CHF, // Швейцарский франк
  CNY, // Китайский юань
  HKD, // Гонконгский доллар
  NZD, // Новозеландский доллар
  SEK, // Шведская крона
  KRW, // Южнокорейская вона
  SGD, // Сингапурский доллар
  NOK, // Норвежская крона
  MXN, // Мексиканский песо
  INR, // Индийская рупия
  RUB, // Российский рубль
  ZAR, // Южноафриканский рэнд
  TRY, // Турецкая лира
  BRL, // Бразильский реал
  TWD, // Новый тайваньский доллар
  DKK, // Датская крона
  PLN, // Польский злотый
  THB, // Тайский бат
  MYR, // Малайзийский ринггит
  IDR, // Индонезийская рупия
  HUF, // Венгерский форинт
  CZK, // Чешская крона
  ILS, // Израильский шекель
  CLP, // Чилийский песо
  PHP, // Филиппинское песо
  AED, // Дирхам ОАЭ
  COP, // Колумбийский песо
  SAR, // Саудовский риял
  RON, // Румынский лей
  BGN, // Болгарский лев
  KZT, // Казахстанский тенге
  BYN, // Белорусский рубль
}
